fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ++ Начало.Квитко 09.09.25
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаНачалаДействия) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Дата начала действия' обязательно для заполнения", ЭтотОбъект, "ВКМ_ДатаНачалаДействия");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаОкончанияДействия) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Дата окончания действия' обязательно для заполнения", ЭтотОбъект, "ВКМ_ДатаОкончанияДействия");
			Отказ = Истина;
		КонецЕсли;                                                                                                                          
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СуммаАбонентскойПлаты) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Сумма абонентской платы' обязательно для заполнения", ЭтотОбъект, "ВКМ_СуммаАбонентскойПлаты");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СтоимостьЧасаРаботы) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Стоимость часа работы' обязательно для заполнения", ЭтотОбъект, "ВКМ_СтоимостьЧасаРаботы");
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли;
	// -- Конец.Квитко 09.09.25	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
